src/cf/InformationRegisters/НастройкаПрефиксов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПрефиксов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Элементы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Правила</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/НДСВидСчетаФактуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>НДСВидСчетаФактуры</Name>
			<Comment>Вид выставленного счета-фактуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаРеализацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исправительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПокупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лизинг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/СчетФактураВыданный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>СчетФактураВыданный</Name>
			<BasedOn>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеВходящее</xr:Item>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.ОтчетОРозничныхПродажах</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСНачисленный</xr:Item>
				<xr:Item>AccumulationRegister.НДСсАвансов</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеРеализацииТоваровУслугНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КомиссияОтчетПродажиКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.КомиссияОтчетПродажиКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВзаимозачета</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:CatalogRef.ФантомныеСсылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежноРасчетногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежноРасчетногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированПриВводеНачальныхОстатковНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДСВидСчетаФактуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийАвтор</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеКорректировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
					<Comment>Документы основания для выписки счета-фактуры</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеРеализацииТоваровУслугНДС</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.КомиссияОтчетПродажиКомитенту</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.КомиссияОтчетПродажиКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВзаимозачета</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:CatalogRef.ФантомныеСсылки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДатаНомерДокументовОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежноРасчетногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежноРасчетногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Авансы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеРеализацииТоваровУслугНДС</v8:Type>
								<v8:Type>cfg:DocumentRef.КомиссияОтчетПродажиКомитенту</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.КомиссияОтчетПродажиКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВзаимозачета</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:CatalogRef.ФантомныеСсылки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/УправлениеПрефиксамиСервер/Ext/Module.bsl
Функция Сформировать(Объект, Префикс) Экспорт
	СтруктураПрефикса=СтруктураПрефикса(Объект);
	Если СтруктураПрефикса=Неопределено Тогда Возврат Префикс; КонецЕсли; 

	МетаданныеДокумента=Объект.Метаданные();

	стрПрефиксРИБ=?(СтруктураПрефикса.ПрефиксРИБ, ПараметрыСеанса.ПрефиксУзлаРИБ , "");	
	стрШаблон=?(ПустаяСтрока(СтруктураПрефикса.ПрефиксШаблон), "[РИБ][ПРЕФИКС][ПЕРИОД]-", СтруктураПрефикса.ПрефиксШаблон);
	Если УправлениеМетаданными.ЕстьРеквизит("Организация", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Объект.Организация.Префикс) Тогда
		Если Найти(стрШаблон, "[ОРГАНИЗАЦИЯ]")=0 Тогда
			стрШаблон="[ОРГАНИЗАЦИЯ]"+стрШаблон;
		КонецЕсли;
		стрШаблон=СтрЗаменить(стрШаблон, "[ОРГАНИЗАЦИЯ]", Объект.Организация.Префикс);
	КонецЕсли;
	стрШаблон=СтрЗаменить(стрШаблон, "[РИБ]", стрПрефиксРИБ);
	стрШаблон=СтрЗаменить(стрШаблон, "[ПЕРИОД]", СтруктураПрефикса.ПрефиксПериод);
	стрШаблон=СтрЗаменить(стрШаблон, "[ПРЕФИКС]", СтруктураПрефикса.Префикс);

	Если МетаданныеДокумента.ПолноеИмя()="Документ.СчетФактураВыданный" Тогда
		стрШаблон=?(Объект.ВидСчетаФактуры=Перечисления.НДСВидСчетаФактуры.НаАванс, "А", "")+стрШаблон;
	КонецЕсли;
	
	Префикс=стрШаблон;
	
	Возврат Префикс; 
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Дополнительные функции

Функция СтруктураПрефикса(Объект) Экспорт
	ОбъектМетаданныхСсылка=Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", Объект.Метаданные().ПолноеИмя());
	Если ОбъектМетаданныхСсылка.Пустая() Тогда Возврат Неопределено; КонецЕсли; //Ошибка (такого быть не должно)

	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ИсточникДанных", ОбъектМетаданныхСсылка);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	НастройкаПрефиксов.Правила,
	|	НастройкаПрефиксов.Элементы
	|ИЗ
	|	РегистрСведений.НастройкаПрефиксов КАК НастройкаПрефиксов
	|ГДЕ
	|	НастройкаПрефиксов.ИсточникДанных = &ИсточникДанных
	|";
	Выборка=Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда Возврат Неопределено; КонецЕсли;
	
	тзПравила=Выборка.Правила.Получить();
	Если НЕ ТипЗнч(тзПравила)=Тип("ТаблицаЗначений") Тогда Возврат Неопределено; КонецЕсли;
	
	тзЭлементы=Выборка.Элементы.Получить();
	Если НЕ ТипЗнч(тзЭлементы)=Тип("ТаблицаЗначений") Тогда Возврат Неопределено; КонецЕсли;

	тзСоответствия=ТаблицаСоответствий(Объект, тзЭлементы, тзПравила, Объект.Ссылка.Пустая());
	Если тзСоответствия.Количество()=0 Тогда Возврат Неопределено; КонецЕсли;

	СтруктураПрефикса=Новый Структура;
	СтруктураПрефикса.Вставить("Префикс", тзСоответствия[0].Префикс);
	СтруктураПрефикса.Вставить("ПрефиксРИБ", тзСоответствия[0].ПрефиксРИБ);
	СтруктураПрефикса.Вставить("ПрефиксПериод", тзСоответствия[0].ПрефиксПериод);
	СтруктураПрефикса.Вставить("ПрефиксШаблон", тзСоответствия[0].ПрефиксШаблон);
	Если ЗначениеЗаполнено(СтруктураПрефикса.ПрефиксПериод) Тогда
		СтруктураПрефикса.ПрефиксПериод=СформироватьПредставлениеПериода(СтруктураПрефикса.ПрефиксПериод, Объект.Дата);
	КонецЕсли;

	Возврат СтруктураПрефикса;
КонецФункции

Функция ЗначениеРеквизитаПоСсылке(Ссылка, Путь)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст="
	|ВЫБРАТЬ
	|"+Путь+" Как Реквизит
	|ИЗ
	|	"+Ссылка.Метаданные().ПолноеИмя()+" КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Ссылка = &Ссылка
	|";
	Выборка=Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Реквизит, Неопределено); 
КонецФункции

Функция ЗначениеРеквизитаПоОбъекту(Объект, Путь)
	стрВыражение="Объект";
	Массив=СтрРазделить(Путь, ".");
	Для каждого ИмяРеквизита Из Массив Цикл
		стрВыражение=стрВыражение+"["""+ИмяРеквизита+"""]";
	КонецЦикла;	 
	Возврат Вычислить(стрВыражение);
КонецФункции

Функция СформироватьПредставлениеПериода(стрПрефикс, Дата)
	Если Дата=Неопределено Тогда Возврат ""; КонецЕсли;

	Если стрПрефикс="НомерДняГода" Тогда
		Возврат Формат(ДеньГода(Дата),"ЧЦ=3; ЧВН=");
	ИначеЕсли стрПрефикс="НомерДняМесяца" Тогда
		Возврат Формат(Месяц(Дата), "ЧЦ=2; ЧВН=")+"-"+Формат(День(Дата),"ЧЦ=2; ЧВН=");
	ИначеЕсли стрПрефикс="НомерНедели" Тогда
		Возврат Формат(ДеньНедели(Дата),"ЧЦ=2; ЧВН=");
	ИначеЕсли стрПрефикс="НомерМесяца" Тогда
		Возврат Формат(Месяц(Дата),"ЧЦ=2; ЧВН=");
	ИначеЕсли стрПрефикс="НомерКвартала" Тогда
		Возврат Формат(Цел((Месяц(Дата)-1)/3)+1,"ЧЦ=2; ЧВН=");
	ИначеЕсли стрПрефикс="НомерГода" Тогда
		Возврат Прав(Строка(Год(Дата)),2);
	ИначеЕсли стрПрефикс="НомерГодаМесяца" Тогда
		Возврат Прав(Строка(Год(Дата)),2)+Формат(Месяц(Дата),"ЧЦ=2; ЧВН=");
	ИначеЕсли стрПрефикс="НомерГодаМесяцаДня" Тогда
		Возврат Прав(Строка(Год(Дата)), 2)+Формат(Месяц(Дата),"ЧЦ=2; ЧВН=")+Формат(День(Дата),"ЧЦ=2; ЧВН=");
	КонецЕсли;
	
	Возврат "";
КонецФункции

Функция ТаблицаСоответствий(Объект, тзЭлементы, тзПравила, ЭтоНовыйОбъект)
	ОбъектЯвляетсяСсылкой=ОбщегоНазначенияСервер.ЭтоСсылка(ТипЗнч(Объект));
	
	тзСоответствия=Новый ТаблицаЗначений;

	//Добавим колонки "измерения" в таблицу соответствий
	Для Каждого СтрокаКоллекции Из тзЭлементы Цикл
		стрКолонка=СтрЗаменить(СтрокаКоллекции.Идентификатор, ".", "_");
		тзСоответствия.Колонки.Добавить(стрКолонка, Новый ОписаниеТипов("Число"));
	КонецЦикла;

	//Добавим колонки "ресурсы" в таблицу соответствий
	тзСоответствия.Колонки.Добавить("Префикс", Новый ОписаниеТипов("Строка"));
	тзСоответствия.Колонки.Добавить("ПрефиксРИБ", Новый ОписаниеТипов("Булево"));
	тзСоответствия.Колонки.Добавить("ПрефиксПериод", Новый ОписаниеТипов("Строка"));
	тзСоответствия.Колонки.Добавить("ПрефиксШаблон", Новый ОписаниеТипов("Строка"));
	
	//Заполняем таблицу соответствий
	УровеньСоответствияПоУмолчанию=1000;
	Для Каждого СтрокаПравила Из тзПравила Цикл
		фСоответствие=0; ОбъектСтрокаСоответствия=тзСоответствия.Добавить();
		//ОбъектСтрокаСоответствия=Неопределено;
		//Если НЕ ПустаяСтрока(СтрокаПравила.ПрефиксПериод) Тогда
		//	стрПериод1=СформироватьПредставлениеПериода(СтрокаПравила.ПрефиксПериод, Объект.Дата);
		//	стрПериод2=СформироватьПредставлениеПериода(СтрокаПравила.ПрефиксПериод, ЗначениеРеквизитаПоСсылке(Объект.Ссылка, "Дата"));
		//	Если НЕ стрПериод1=стрПериод2 Тогда
		//		ОбъектСтрокаСоответствия=тзСоответствия.Добавить();
		//	КонецЕсли;
		//	Если ОбъектСтрокаСоответствия=Неопределено Тогда Продолжить; КонецЕсли;
		//КонецЕсли; //**************

		Для Каждого СтрокаАтрибута Из тзЭлементы Цикл
			стрПуть=СокрЛП(СтрокаАтрибута.Идентификатор);
			Если ОбъектЯвляетсяСсылкой Тогда
				ЗначениеИзмерения=ЗначениеРеквизитаПоСсылке(Объект.Ссылка, стрПуть);
			Иначе
				ЗначениеИзмерения=ЗначениеРеквизитаПоОбъекту(Объект, стрПуть);
				Если НЕ ЭтоНовыйОбъект И ЗначениеИзмерения=ЗначениеРеквизитаПоСсылке(Объект.Ссылка, стрПуть) Тогда
					Продолжить; // Значения не изменились
				КонецЕсли;
			КонецЕсли;

			ЗначениеКолонки=СтрокаПравила[СтрЗаменить(стрПуть, ".", "_")];

			// TODO продумать для разных типов соответствий -
			//как они должны себя вести при пустых значениях измерений в правилах и/или пустых значений переданных измерений
			//пока использую правило: Если входное значение неопределено, то нет однозначных правил (кроме правила "для всех"):
			//Необходимо ввести понятие ЮНИВЕРСУМ

			Если Не ЗначениеЗаполнено(ЗначениеКолонки) Тогда //Подходит любое значение измерения
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЗначениеИзмерения) Тогда
				фСоответствие=-1; Прервать;
			КонецЕсли;

			Если ТипЗнч(ЗначениеКолонки)=Тип("Строка")Тогда ЗначениеКолонки=СокрЛП(ЗначениеКолонки); КонецЕсли;

			фСоответствие=?(ЗначениеИзмерения=ЗначениеКолонки, УровеньСоответствияПоУмолчанию, -1);
			Если фСоответствие=-1 Тогда
				стрТипВид=ТипОбъекта(ЗначениеКолонки, 1, Символы.ПС);
				стрТип=стрПолучитьСтроку(стрТипВид, 1);
				стрВид=стрПолучитьСтроку(стрТипВид, 2);
				Если стрТип="Справочник"  Тогда
					стрВидИерархии=Строка(Метаданные.Справочники[стрВид].ВидИерархии);
					Если стрВидИерархии="ИерархияЭлементов" Тогда
						фСоответствие=?(ЗначениеИзмерения.ПринадлежитЭлементу(ЗначениеКолонки)=1, ЗначениеКолонки.Уровень()+1, -1);
					ИначеЕсли стрВидИерархии="ИерархияГруппИЭлементов" Тогда
						Если ЗначениеКолонки.ЭтоГруппа Тогда //Если ЗначениеРеквизитаОбъекта(ЗначениеКолонки, "ЭтоГруппа") Тогда
							фСоответствие=?(ЗначениеИзмерения.ПринадлежитЭлементу(ЗначениеКолонки)=1, ЗначениеКолонки.Уровень()+1, -1);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если фСоответствие=-1 Тогда Прервать; КонецЕсли;

			Если ОбъектСтрокаСоответствия=Неопределено Тогда
				ОбъектСтрокаСоответствия=тзСоответствия.Добавить();
			КонецЕсли;			
			ОбъектСтрокаСоответствия[СтрЗаменить(стрПуть, ".", "_")]=фСоответствие;
		КонецЦикла;
		Если ОбъектСтрокаСоответствия=Неопределено Тогда Продолжить; КонецЕсли;

		Если фСоответствие=-1 Тогда
			тзСоответствия.Удалить(ОбъектСтрокаСоответствия);
			Продолжить;
		КонецЕсли;

		//Заполним ресурсы таблицы соответствия текущей строки
		ОбъектСтрокаСоответствия["Префикс"]=СтрокаПравила["Префикс"];
		ОбъектСтрокаСоответствия["ПрефиксРИБ"]=СтрокаПравила["ПрефиксРИБ"];
		ОбъектСтрокаСоответствия["ПрефиксПериод"]=СтрокаПравила["ПрефиксПериод"];
		ОбъектСтрокаСоответствия["ПрефиксШаблон"]=СтрокаПравила["ПрефиксШаблон"];
	КонецЦикла;

	Возврат тзСоответствия;
КонецФункции

Функция ТипОбъекта(Объект, Режим=0, Разделитель=".") Экспорт
	// Режим: 0 - тип объекта, 1 - тип+вид объекта
	Попытка мдОбъект=Объект.Метаданные();
	Исключение Возврат Строка(ТипЗнч(Объект));
	КонецПопытки;

	Если Режим=0 Тогда Возврат СтрЗаменить(мдОбъект.ПолноеИмя(), "."+мдОбъект.Имя, ""); КонецЕсли; 
	
	стрТипВид=мдОбъект.ПолноеИмя();
	Если Разделитель<>"." Тогда стрТипВид=стрЗаменить(стрТипВид, ".", Разделитель); КонецЕсли;

	Возврат стрТипВид;	
КонецФункции
